// 1. Спросить у пользователя чётное число в интервале от 10 до 50 и поделить его пополам и вывести в консоль результат.

let askNumber = prompt('вкажіть число від 10 до 50-ти');
console.log(askNumber);

let result = askNumber / 2;
console.log(result);

// 2. Посчитать пример, без консоли (на листике), потом проверить в консоли

//   let num = -124;
//   let x = 100 + (num *= 5);

let x = 100 + - 124 * 5;
console.log(x);

// 3. Напишите результаты с учётом преобразования типов данных без компьютера на листике, потом проверь себя  на компьютере

//     1) "" + 15 + 5
        // 0  + 15 + 5 = 155

let ex_1 = "" + 15 + 5;
console.log(ex_1);     


//     2) "" - 10 + 5 = -5

let ex_2 = "" - 10 + 5;
console.log(ex_2);            


//     3) false + true = 0 + 1 = 1

let ex_3 = false + true;
console.log(ex_3);  

//     4) 69 / "3" = 23

let ex_4 = 69 / '3';
console.log(ex_4);  


//     5) "10" * "20" = 200

let ex_5 = '10' * '20';
console.log(ex_5); 

//     6) 12+ 10 + "px" = 22px

let ex_6 = 12 + 10 + "px";
console.log(ex_6); 

// =========================//
// 1.1. Виконай додавання 0,1 і 0,2 добийся математично правильної відповіді.

let ex_1_1 = (0.1 + 0.2).toFixed(1);
console.log(ex_1_1);

//  1.2.Виконай додавання рядка "1" і цифри 2 (обидві операнди повинні бути в змінних), добийся математично правильної відповіді.

let a = '1', b = 2;

let ex_1_2 = a + b;
console.log(ex_1_2);

// 1.3/ Користувач вказує обсяг флешки в Гб. Програма повинна порахувати скільки файлів розміром в 820 Мб поміщається на флешку.

let askCapacity = prompt('вкажіть обсяг флешки в Гб');
let result_2 = askCapacity / 0.82;
console.log(Math.floor(result_2));


// ==========================

// Користувач вводить суму грошей в гаманці і ціну однієї шоколадки. Програма виводить скільки шоколадок може купити користувач і скільки здачі у нього залишиться.

let askSumm = prompt('вкажіть cуму грошей');
let askPrice = prompt('вкажіть ціну шоколадки');
console.log(Math.floor(askSumm/askPrice));
console.log(askSumm - (askSumm / askPrice));

// Запитай у користувача тризначне число і виведи його задом наперед. Для вирішення завдання тобі знадобиться оператор % (залишок від ділення).